In [1]:
import pandas as pd

Insert

In [3]:
df1=pd.DataFrame({"a":[1,2,3,4,5],"b":[6,7,8,9,10]})
df1

   a   b
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [4]:
df1.insert(2,"c",df1["a"])#inserting new column at last position and the values are copying from col a
df1

   a   b  c
0  1   6  1
1  2   7  2
2  3   8  3
3  4   9  4
4  5  10  5

In [5]:
df1.insert(3,"d",[33,44,55,66,77])#here i am createing another column d with random values using list
df1

   a   b  c   d
0  1   6  1  33
1  2   7  2  44
2  3   8  3  55
3  4   9  4  66
4  5  10  5  77

In [6]:
df1["e"]=df1["a"][:3]#we can use slice operator also to create a new column with limited no of values 
df1

   a   b  c   d    e
0  1   6  1  33  1.0
1  2   7  2  44  2.0
2  3   8  3  55  3.0
3  4   9  4  66  NaN
4  5  10  5  77  NaN

Delete

In [11]:
df2=df1.pop("e")#we can delete any column with help of pop
df2

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
Name: e, dtype: float64

In [12]:
df1

   a  c   d
0  1  1  33
1  2  2  44
2  3  3  55
3  4  4  66
4  5  5  77

In [13]:
del df1["a"] #can use del also to delete any column
df1

   c   d
0  1  33
1  2  44
2  3  55
3  4  66
4  5  77